Study2/src/Documents/ЗаказПоставщику/ЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПоставщику</name>
  <registerRecords>AccumulationRegister.ЗаказанныеТовары</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ФилиалПоставки</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Study2/src/Documents/ЗаказПоставщику/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ЗаполнениеИзОбработки Тогда
		
		ОбъектДокумента = РеквизитФормыВЗначение("Объект");
		ОбъектДокумента.Дата=ТекущаяДата();
		
		Если Параметры.Филиал.Количество() = 1 Тогда  
			ОбъектДокумента.ФилиалПоставки = Параметры.Филиал[0].Значение;
		КонецЕсли;
		
		ТабЧасть = ПолучитьИзВременногоХранилища(Параметры.Адрес); 
		Для каждого Строка из ТабЧасть Цикл
			СтрокаТабЧасти = ОбъектДокумента.Состав.Добавить();
			СтрокаТабЧасти.Номенклатура = Строка.Номенклатура;
			СтрокаТабЧасти.Количество = Строка.Количество; 
		КонецЦикла;
		
		ЗначениеВРеквизитФормы(ОбъектДокумента,"Объект");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставЦенаИЛИКоличествоПриИзменении(Элемент)
	
	ТекДанные = Элементы.Состав.ТекущиеДанные;
	Если (ТекДанные <> Неопределено) Тогда
		ТекДанные.Сумма = ТекДанные.Количество * ТекДанные.Цена;
	КонецЕсли;
	ПересчитатьСуммуДокумента();  
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Состав.Итог("Сумма");
	
КонецПроцедуры
